In [1]:
import pandas as pd

# Pandas Data Structures, Series and DataFrame

###series###

In [7]:
s1 = pd.Series([11,22,33,44,55,66,77,88,99,100])
s1 #pandas series object with 0 -9 index

0     11
1     22
2     33
3     44
4     55
5     66
6     77
7     88
8     99
9    100
dtype: int64

In [8]:
s1[9] #accessing vlue by index

100

In [9]:
s1[[2,4,7,9]] #accessing multiple values

2     33
4     55
7     88
9    100
dtype: int64

In [10]:
s1[5]=5000 #modifying a value in series

In [11]:
s1

0      11
1      22
2      33
3      44
4      55
5    5000
6      77
7      88
8      99
9     100
dtype: int64

In [12]:
del s1[5] #deleting a value in series

In [13]:
s1

0     11
1     22
2     33
3     44
4     55
6     77
7     88
8     99
9    100
dtype: int64

In [27]:
s1[[2,6,7,8]]=[222,666,777,888] #modifying mutliple values

In [25]:
s1

0       11
1       22
2      222
3       44
4       55
6      666
7      777
8      888
9      100
99    9999
dtype: int64

In [30]:
s1[100]=1009 #insert values with any index not available

In [31]:
s1

0        11
1        22
2       222
3        44
4        55
6       666
7       777
8       888
9       100
99     9999
100    1009
dtype: object

In [33]:
s2 = pd.Series([10,20,30,40], index=['oranges','apples','bananas','mangoes'])

In [34]:
s2

oranges    10
apples     20
bananas    30
mangoes    40
dtype: int64

In [35]:
s2.index

Index(['oranges', 'apples', 'bananas', 'mangoes'], dtype='object')

In [36]:
s2.values

array([10, 20, 30, 40], dtype=int64)

In [37]:
OurIndex = ['oranges','apples','bananas','mangoes']

s2= pd.Series([10,20,30,40], index=OurIndex)

In [38]:
s2

oranges    10
apples     20
bananas    30
mangoes    40
dtype: int64

In [41]:
s2>30 #will tell where values is true or false i.e.compare with all

oranges    False
apples     False
bananas    False
mangoes     True
dtype: bool

In [42]:
s2[s2<30]#will show onky true values

oranges    10
apples     20
dtype: int64

In [43]:
'Peach' in s2 #check if key is in series or not

False

In [44]:
'oranges' in s2

True

# Creating a series using dictionary

In [54]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

data = pd.Series(sdata)

In [55]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
data1 = pd.Series(sdata, index = states)
data1

#values present in old data will be added and new values with no dat show NaN (not a number)

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [56]:
data1.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [57]:
data1['California']=55000 #adding values to the key updated in the old data
data1

California    55000.0
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [58]:
data1.isnull()

California    False
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [59]:
data1.notnull()

California    True
Ohio          True
Oregon        True
Texas         True
dtype: bool

# Data Frame

In [64]:
data = {'State': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'Year': [2000, 2001, 2002, 2001, 2002, 2003],
        'Pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
        }
#key is column header

df1 = pd.DataFrame(data)
df1

    State  Year  Pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [71]:
data = {'Name': ['Khizra', 'Ayesha', 'Dania', 'Hadiqa', 'Zubia', 'Wajiha'],
        'Roll No': [1, 2, 3, 4, 5, 6],
        'Program':['AI', 'AI', 'AI', 'AI', 'AI', 'AI'],
        'Marks-AI for Everyone':[90, 82, 85, 79, 68, 78],
        'Marks-Python1':[78, 59, 89, 80, 56, 65],
        'Marks-Python2':[91,77, 67, 88, 93,99]
        }

In [74]:
df2 = pd.DataFrame(data)
df2

,Name,Roll No,Program,Marks-AI for Everyone,Marks-Python1,Marks-Python2
0,Khizra,1,AI,90,78,91
1,Ayesha,2,AI,82,59,77
2,Dania,3,AI,85,89,67
3,Hadiqa,4,AI,79,80,88
4,Zubia,5,AI,68,56,93
5,Wajiha,6,AI,78,65,99

In [75]:
type(df2)

pandas.core.frame.DataFrame

In [76]:
df2.shape

(6, 6)

In [81]:
df2[['Name','Marks-AI for Everyone']] #selecting multiple columns by column header

     Name  Marks-AI for Everyone
0  Khizra                     90
1  Ayesha                     82
2   Dania                     85
3  Hadiqa                     79
4   Zubia                     68
5  Wajiha                     78

In [85]:
df2['Roll No']

0    1
1    2
2    3
3    4
4    5
5    6
Name: Roll No, dtype: int64

In [86]:
del df2['Program']

In [87]:
df2

     Name  Roll No  Marks-AI for Everyone  Marks-Python1  Marks-Python2
0  Khizra        1                     90             78             91
1  Ayesha        2                     82             59             77
2   Dania        3                     85             89             67
3  Hadiqa        4                     79             80             88
4   Zubia        5                     68             56             93
5  Wajiha        6                     78             65             99

In [90]:
df2['Result']='Pass' #aading new column with a single value
df2

     Name  Roll No  Marks-AI for Everyone  Marks-Python1  Marks-Python2 Result
0  Khizra        1                     90             78             91   Pass
1  Ayesha        2                     82             59             77   Pass
2   Dania        3                     85             89             67   Pass
3  Hadiqa        4                     79             80             88   Pass
4   Zubia        5                     68             56             93   Pass
5  Wajiha        6                     78             65             99   Pass

In [92]:
df2['Program']=['AI','AI','AI','AI','AI','AI',] #adding single column with multiple values
df2

,Name,Roll No,Marks-AI for Everyone,Marks-Python1,Marks-Python2,Result,Program
0,Khizra,1,90,78,91,Pass,AI
1,Ayesha,2,82,59,77,Pass,AI
2,Dania,3,85,89,67,Pass,AI
3,Hadiqa,4,79,80,88,Pass,AI
4,Zubia,5,68,56,93,Pass,AI
5,Wajiha,6,78,65,99,Pass,AI

In [95]:
df2['Marks-AI for Everyone'] = df2['Marks-Python1']
df2

,Name,Roll No,Marks-AI for Everyone,Marks-Python1,Marks-Python2,Result,Program
0,Khizra,1,78,78,91,Pass,AI
1,Ayesha,2,59,59,77,Pass,AI
2,Dania,3,89,89,67,Pass,AI
3,Hadiqa,4,80,80,88,Pass,AI
4,Zubia,5,56,56,93,Pass,AI
5,Wajiha,6,65,65,99,Pass,AI

In [97]:
df2['Marks-AI for Everyone']= range(6)

In [98]:
df2

,Name,Roll No,Marks-AI for Everyone,Marks-Python1,Marks-Python2,Result,Program
0,Khizra,1,0,78,91,Pass,AI
1,Ayesha,2,1,59,77,Pass,AI
2,Dania,3,2,89,67,Pass,AI
3,Hadiqa,4,3,80,88,Pass,AI
4,Zubia,5,4,56,93,Pass,AI
5,Wajiha,6,5,65,99,Pass,AI

In [100]:
df2['Marks-AI for Everyone']=[90,87,57,78,65,88]

In [101]:
df2

,Name,Roll No,Marks-AI for Everyone,Marks-Python1,Marks-Python2,Result,Program
0,Khizra,1,90,78,91,Pass,AI
1,Ayesha,2,87,59,77,Pass,AI
2,Dania,3,57,89,67,Pass,AI
3,Hadiqa,4,78,80,88,Pass,AI
4,Zubia,5,65,56,93,Pass,AI
5,Wajiha,6,88,65,99,Pass,AI

In [4]:
dic={ 'AI for Everyone':[90, 82, 85, 79, 68, 78],
        'Python1':[78, 59, 89, 80, 56, 65],
        'Python2':[91,77, 67, 55, 55,55]
    }

df = pd.DataFrame(dic, index=['Khizra', 'Ayesha', 'Dania', 'Hadiqa', 'Zubia', 'Wajiha'])

In [5]:
df

        AI for Everyone  Python1  Python2
Khizra               90       78       91
Ayesha               82       59       77
Dania                85       89       67
Hadiqa               79       80       55
Zubia                68       56       55
Wajiha               78       65       55

In [6]:
df['Total Marks']= df['AI for Everyone']+df['Python1']+df['Python2'] #.sum all columns

In [7]:
df

        AI for Everyone  Python1  Python2  Total Marks
Khizra               90       78       91          259
Ayesha               82       59       77          218
Dania                85       89       67          241
Hadiqa               79       80       55          214
Zubia                68       56       55          179
Wajiha               78       65       55          198

In [8]:
df

        AI for Everyone  Python1  Python2  Total Marks
Khizra               90       78       91          259
Ayesha               82       59       77          218
Dania                85       89       67          241
Hadiqa               79       80       55          214
Zubia                68       56       55          179
Wajiha               78       65       55          198

In [10]:
df['Total Marks']>200

Khizra     True
Ayesha     True
Dania      True
Hadiqa     True
Zubia     False
Wajiha    False
Name: Total Marks, dtype: bool

In [63]:
df['Status'] = ['Pass'if Marks>=200 else 'Fail' for Marks in df['Total Marks']]
df

        AI for Everyone  Python1  Python2  Total Marks Status  Percentage
Khizra               90       78       91          259   Pass   86.333333
Ayesha               82       59       77          218   Pass   72.666667
Dania                85       89       67          241   Pass   80.333333
Hadiqa               79       80       55          214   Pass   71.333333
Zubia                68       56       55          179   Fail   59.666667
Wajiha               78       65       55          198   Fail   66.000000
Ali                  67       89       98            1   Fail    3.000000

In [64]:
df['Percentage']= (df['Total Marks']/300)*100
df

        AI for Everyone  Python1  Python2  Total Marks Status  Percentage
Khizra               90       78       91          259   Pass   86.333333
Ayesha               82       59       77          218   Pass   72.666667
Dania                85       89       67          241   Pass   80.333333
Hadiqa               79       80       55          214   Pass   71.333333
Zubia                68       56       55          179   Fail   59.666667
Wajiha               78       65       55          198   Fail   66.000000
Ali                  67       89       98            1   Fail    0.333333

In [65]:
numbers = [2,3,4,5,1,6,7,8,9]
evenArr = []
oddArr = []
for num in numbers:
    if num%2 == 0:
        evenArr.append(num)
    else:
        oddArr.append(num)
print('Even nos',evenArr)
print('Odd nos', oddArr)

Even nos [2, 4, 6, 8]
Odd nos [3, 5, 1, 7, 9]

In [66]:
[num for num in numbers if num%2 == 0]

[2, 4, 6, 8]

In [67]:
a = list(range(5))
b = list(range(6,11))
a

[0, 1, 2, 3, 4]

In [68]:
b

[6, 7, 8, 9, 10]

In [69]:
c = zip(a,b)
for i in c:
    print(i)

(0, 6)
(1, 7)
(2, 8)
(3, 9)
(4, 10)

In [70]:
df['Status']=['Pass' if AI>=60 and P1>=60 and P2>=60 else 'Fail'
for AI,P1,P2 in zip(df['AI for Everyone'], df['Python1'], df['Python2'])]

In [71]:
df

        AI for Everyone  Python1  Python2  Total Marks Status  Percentage
Khizra               90       78       91          259   Pass   86.333333
Ayesha               82       59       77          218   Fail   72.666667
Dania                85       89       67          241   Pass   80.333333
Hadiqa               79       80       55          214   Fail   71.333333
Zubia                68       56       55          179   Fail   59.666667
Wajiha               78       65       55          198   Fail   66.000000
Ali                  67       89       98            1   Pass    0.333333

In [72]:
df.head()#top 5 data

        AI for Everyone  Python1  Python2  Total Marks Status  Percentage
Khizra               90       78       91          259   Pass   86.333333
Ayesha               82       59       77          218   Fail   72.666667
Dania                85       89       67          241   Pass   80.333333
Hadiqa               79       80       55          214   Fail   71.333333
Zubia                68       56       55          179   Fail   59.666667

In [73]:
df.tail()

        AI for Everyone  Python1  Python2  Total Marks Status  Percentage
Dania                85       89       67          241   Pass   80.333333
Hadiqa               79       80       55          214   Fail   71.333333
Zubia                68       56       55          179   Fail   59.666667
Wajiha               78       65       55          198   Fail   66.000000
Ali                  67       89       98            1   Pass    0.333333

In [74]:
del df['TOtal Marks']

KeyError: 'TOtal Marks'

In [76]:
df

        AI for Everyone  Python1  Python2  Total Marks Status  Percentage
Khizra               90       78       91          259   Pass   86.333333
Ayesha               82       59       77          218   Fail   72.666667
Dania                85       89       67          241   Pass   80.333333
Hadiqa               79       80       55          214   Fail   71.333333
Zubia                68       56       55          179   Fail   59.666667
Wajiha               78       65       55          198   Fail   66.000000
Ali                  67       89       98            1   Pass    0.333333

In [25]:
df.loc['Khizra']

AI for Everyone         90
Python1                 78
Python2                 91
Total Marks            259
Status                Pass
Percentage         86.3333
Name: Khizra, dtype: object

In [77]:
df.loc['Ayesha':'Hadiqa'] #loc also include last row

        AI for Everyone  Python1  Python2  Total Marks Status  Percentage
Ayesha               82       59       77          218   Fail   72.666667
Dania                85       89       67          241   Pass   80.333333
Hadiqa               79       80       55          214   Fail   71.333333

In [78]:
df.iloc[0]

AI for Everyone         90
Python1                 78
Python2                 91
Total Marks            259
Status                Pass
Percentage         86.3333
Name: Khizra, dtype: object

In [79]:
df.iloc[1:5]

        AI for Everyone  Python1  Python2  Total Marks Status  Percentage
Ayesha               82       59       77          218   Fail   72.666667
Dania                85       89       67          241   Pass   80.333333
Hadiqa               79       80       55          214   Fail   71.333333
Zubia                68       56       55          179   Fail   59.666667

In [80]:
df.loc['Wajiha'::-1]

        AI for Everyone  Python1  Python2  Total Marks Status  Percentage
Wajiha               78       65       55          198   Fail   66.000000
Zubia                68       56       55          179   Fail   59.666667
Hadiqa               79       80       55          214   Fail   71.333333
Dania                85       89       67          241   Pass   80.333333
Ayesha               82       59       77          218   Fail   72.666667
Khizra               90       78       91          259   Pass   86.333333

In [81]:
df.loc['Dania']['Python2']

67

In [97]:
df.loc['Ali']= [67,89,98,1,2,3]

In [98]:
df

        AI for Everyone  Python1  Python2  Total Marks Status  Percentage
Khizra               90       78       91          259   Pass   86.333333
Ayesha               82       59       77          218   Fail   72.666667
Dania                85       89       67          241   Pass   80.333333
Hadiqa               79       80       55          214   Fail   71.333333
Zubia                68       56       55          179   Fail   59.666667
Wajiha               78       65       55          198   Fail   66.000000
Ali                  67       89       98            1      2    3.000000

In [103]:
df.loc['Ali'][[3,4]]=[200,'Pass']

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\series.py:1035: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._set_with(key, value)

In [84]:

import numpy as np

a=10
b=20

np.where(b>a, 'Pass', 'FAIL')

array('Pass', dtype='<U4')